#pragma once
#include<string>

static const char* toothPosition_ENGLISH[]
{
	//上颌部
	"Or","ANS","A",
	"PNS","Ptm","Pt",
	//下颌部
	"B","D","Pog","Gn","Me","T2",
	"T1","Ar","Go","Pcd","Co","C","J",
	//颅底部
	"N","S","Po","Ba","Bo",
	//牙/牙槽部
	"UI","UIA","LI","LIA","U6","L6","SPr","Id",
	//软组织
	"G","NS","Prn","Cm","Sn","A'","UL'","UL","LL","LL'","B'","Pos"
};

static const char *toothPosition_CHINA[]
{
	"框点","前鼻棘点","上齿槽座点","后鼻棘点","翼上颌裂点",
	"翼点",
	"下齿槽座点","下颌联合体中心点","颏前点","颏顶点","颏下点"
	"下颌角后下缘","下颌升支后缘","关节点","下颌角点","髁突后援点","髁顶点"
	"颗突中心点","内下颌骨",
	"鼻根点","蝶鞍中心点","机械耳骨","颅底点""Bolton点",
	"上中切牙点","上中切牙根尖点","下颌第一磨牙近中颊尖点","下颌第一磨牙近中颊尖点","上牙槽源点","下牙槽源点",
	"额点","软组织鼻根点","鼻顶点","鼻小柱点","鼻下点","上唇凹点","上唇源点","上唇突点","下唇突点","下唇源点","下唇凹点","软组织颏前点"
};
//记录鼠标点集
static QVector<QPointF>  linePos;